Repository: ITlearning/AI-Product-Factory
Catalog: CodeStudy/iOS/CodeStudy/CodeStudy/Resources/Localizable.xcstrings
Source language: ko
Languages: en

source: %lld일 연속 학습 중
en: %lld day streak

source: %lld회 대화
en: %lld turns

source: %lld회 학습
en: %lld sessions

# action.hint
source: 힌트
en: Hint

# action.quiz
source: 퀴즈
en: Quiz me

# action.simpler
source: 더 쉽게
en: Simpler

# chat.exit.continue
source: 계속 학습하기
en: Keep learning

# chat.exit.leave
source: 나가기
en: Leave

# chat.exit.message
source: 지금 나가면 이 세션의 학습이 저장되지 않아요.
en: If you leave now, this session won't be saved.

# chat.exit.title
source: 정말 나가시겠어요?
en: Leave this session?

# chat.viewResults
source: 학습 결과 보기
en: View results

source: CodeStudy — 무료 다운로드
en: CodeStudy — Free download

# common.ok
source: 확인
en: OK

# complete.home
source: 홈으로
en: Back home

# complete.manual.subtitle
source: 마스터하려면 다시 도전해보세요
en: Try again to fully master it

# complete.manual.title
source: 학습을 마쳤어요
en: Session complete

# complete.mastered.title
source: 이 개념을 마스터했어요!
en: You mastered this concept!

# complete.retry
source: 다시 도전
en: Try again

# complete.saveImage
source: 이미지로 저장
en: Save as image

# complete.share
source: 공유하기
en: Share

# complete.streak.days
source: 일
en: days

# complete.streak.label
source: 연속 학습
en: Current streak

# concept.history.a11y.mastered
source: 마스터 완료
en: Mastered

# concept.history.a11y.studied.suffix
source: 회 학습
en: sessions studied

# concept.history.empty.cta
source: 지금 학습하기
en: Start learning

# concept.history.empty.subtitle
source: 이 개념을 처음 학습해보세요
en: Try this concept for the first time

# concept.history.empty.title
source: 아직 학습한 기록이 없어요
en: No history yet

# concept.history.mastered.badge
source: 마스터
en: Mastered

# concept.history.sessions.header.label
source: 세션
en: Sessions

# concept.history.stat.lastStudied
source: 마지막
en: Last studied

# concept.history.stat.studied
source: 학습 횟수
en: Sessions

# concept.history.title
source: 학습 기록
en: Learning history

# dailyChallenge.comeBack
source: 내일 다시 만나요
en: See you tomorrow

# dailyChallenge.completed
source: 오늘 학습을 모두 완료했어요!
en: You wrapped up today's lesson!

# dailyChallenge.empty.subtitle
source: 매일 하나의 개념을 AI와 함께 배워요
en: Learn a new concept with AI every day

# dailyChallenge.empty.title
source: 첫 번째 Swift 여정을 시작해볼까요?
en: Ready to start your Swift journey?

# dailyChallenge.start
source: 학습 시작
en: Start learning

# dailyChallenge.title
source: 오늘의 학습
en: Today's lesson

# error.retry
source: 다시 시도
en: Retry

# error.title
source: 오류가 발생했어요
en: Something went wrong

# error.unknown
source: 알 수 없는 오류가 발생했습니다
en: Something went wrong

# input.placeholder
source: 메시지를 입력하세요...
en: Type a message...

# input.placeholder.code
source: Swift 코드를 입력하세요...
en: Type Swift code...

# notification.reminder.body
source: 5분만 투자해서 새로운 개념을 마스터해보세요!
en: Spend 5 minutes mastering a new concept.

# notification.reminder.title
source: 오늘의 Swift 학습
en: Today's Swift lesson

# onboarding.experience.no
source: 처음이에요
en: First time

# onboarding.experience.subtitle
source: 학습 난이도를 맞추기 위해 여쭤봐요
en: We ask so we can pick the right pace for you

# onboarding.experience.title
source: 개발 경험이 있으신가요?
en: Have you written code before?

# onboarding.experience.yes
source: 있어요
en: Yes, I have

# onboarding.level.advanced
source: 고급
en: Advanced

# onboarding.level.advanced.desc
source: Concurrency, Macro를 공부하고 싶어요
en: I want to dig into Concurrency and Macros

# onboarding.level.basic
source: 기초
en: Basics

# onboarding.level.basic.desc
source: 변수, 조건문 정도는 알아요
en: I know variables and conditionals

# onboarding.level.beginner
source: 처음
en: Beginner

# onboarding.level.beginner.desc
source: Swift를 처음 접해요
en: Brand new to Swift

# onboarding.level.intermediate
source: 중급
en: Intermediate

# onboarding.level.intermediate.desc
source: 프로토콜, 제네릭을 써봤어요
en: I've used protocols and generics

# onboarding.level.title
source: Swift 경험은 어느 정도인가요?
en: How much Swift have you written?

# onboarding.next
source: 다음
en: Next

# onboarding.notification.description
source: 매일 정해진 시간에 알림을 보내드려요. 꾸준한 학습이 실력을 만듭니다.
en: We'll nudge you at the same time each day. Consistency is what builds the skill.

# onboarding.notification.enable
source: 좋아요
en: Sounds good

# onboarding.notification.skip
source: 괜찮아요
en: Not now

# onboarding.notification.time
source: 알림 시간
en: Reminder time

# onboarding.notification.title
source: 매일 학습 리마인더를 받으시겠어요?
en: Want a daily learning reminder?

# onboarding.skip
source: 건너뛰기
en: Skip

# progress.calendar.header
source: 학습 캘린더
en: Learning calendar

# progress.empty.subtitle
source: 첫 학습을 시작해볼까요?
en: Ready for your first session?

# progress.empty.title
source: 아직 학습한 개념이 없어요
en: No concepts studied yet

# progress.stat.mastered
source: 마스터
en: Mastered

# progress.stat.streak
source: 연속
en: Streak

# progress.stat.studied
source: 학습 완료
en: Studied

# progress.title
source: 학습 기록
en: Learning history

# save.failed.message
source: 이미지를 저장하지 못했어요. 잠시 후 다시 시도해주세요.
en: We couldn't save the image. Please try again.

# save.failed.title
source: 저장 실패
en: Save failed

# save.permission.message
source: 설정 > CodeStudy에서 사진 접근을 허용해주세요.
en: Allow Photos access in Settings > CodeStudy.

# save.permission.title
source: 사진 접근 권한 필요
en: Photos access needed

# save.success.message
source: 사진 앱에 이미지를 저장했어요.
en: Image saved to Photos.

# save.success.title
source: 저장 완료
en: Saved

# session.row.duration.minutes.suffix
source: 분
en: min

# session.row.duration.seconds.suffix
source: 초
en: sec

# session.row.turns.suffix
source: 회 대화
en: turns

# settings.credits
source: 만든 사람
en: Made by

# settings.language
source: 언어
en: Language

# settings.level
source: Swift 레벨
en: Swift level

# settings.notification.daily
source: 매일 학습 알림
en: Daily reminder

# settings.notification.time
source: 알림 시간
en: Reminder time

# settings.section.about
source: 앱 정보
en: About

# settings.section.notifications
source: 알림
en: Notifications

# settings.section.profile
source: 프로필
en: Profile

# settings.title
source: 설정
en: Settings

# settings.version
source: 버전
en: Version

# streak.days
source: 일 연속
en: day streak

# streak.firstDay
source: 오늘이 첫 날이에요!
en: Day one. Let's go!

# streak.freeze.toast
source: 어제 freeze로 스트릭 지켰어요!
en: Used a freeze to keep your streak alive!

# streak.freeze.toast.a11y
source: 어제 freeze로 스트릭을 지켰어요
en: Streak preserved with yesterday's freeze

# survey.error.offline
source: 다음 업데이트 때 다시 있을게요
en: We'll catch you next time

# survey.intro.body.line1
source: 1-2분만 의견 들려주시면 추첨으로 스타벅스 쿠폰 보내드려요 ☕️
en: Share 1-2 minutes of feedback for a chance to win a Starbucks gift card ☕️

# survey.intro.body.line2
source: 더 나은 앱 만들고 싶어서요.
en: I want to build a better app.

# survey.intro.close.a11y
source: 닫기
en: Close

# survey.intro.cta
source: 응답하기
en: Respond

# survey.intro.heading
source: 이 개념 마스터한 거 자랑스러워요!
en: Proud you mastered this concept!

# survey.web.done
source: 완료
en: Done

# tip.history.title
source: 학습 여정 다시 보기
en: Revisit your learning journey

# tip.history.message
source: 개념을 탭하면 모든 학습 세션과 대화 내용을 다시 볼 수 있어요
en: Tap any concept to revisit your study sessions and conversations.

# tip.historyTab.title
source: 새로운 기능이 추가됐어요
en: New feature added

# tip.historyTab.message
source: 학습 기록 탭을 누르면 마스터한 개념의 학습 여정을 다시 볼 수 있어요
en: Tap History to revisit your learning journey for any mastered concept.

# tab.learn
source: 학습
en: Learn

# tab.progress
source: 기록
en: History

# tab.settings
source: 설정
en: Settings

source: 나도 AI로 Swift 공부하기
en: Learn Swift with AI too

source: 많음
en: More

source: 응답을 받는 중 오류가 발생했습니다
en: An error occurred while receiving a response.

source: 이 세션의 대화 한도에 도달했어요
en: You have reached the chat limit for this session.

source: 인터넷 연결을 확인해주세요
en: Please check your internet connection.

source: 잘못된 응답입니다
en: That's the wrong answer.

source: 잠시 후 다시 시도해주세요
en: Please try again in a moment.

source: 적음
en: Less

source: 최장 %lld일
en: Up to %lld days

source: 학습 데이터 저장에 실패했습니다
en: Failed to save training data.

source: 한국어
en: Korean
